{
  "backend/main.mo": "Main backend actor defining product, order, user profile, and checkout session types with CRUD operations, Stripe integration, access control, and admin functions for managing products, orders, and price markup.",
  "feature_evidence.json": "Feature evidence report documenting six cart removal features (CartContext, Cart component, CartButton, Header integration, ProductCard buttons, and Checkout dependencies) with high confidence and associated test IDs.",
  "frontend-file-summaries.txt": "Summaries of frontend files describing UI components, styling, routing, cart functionality (to be removed), authentication, payment integration, and admin features.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode CSS variables for backgrounds, foregrounds, borders, and component theming.",
  "frontend/index.html": "HTML entry point with root div and script tag loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Root React component that renders the TanStack RouterProvider with the configured router.",
  "frontend/src/components/About.tsx": "About section component displaying three feature cards (Creative Excellence, Goal-Oriented, Passionate Work) with icons and descriptive portfolio content.",
  "frontend/src/components/AdminGuard.tsx": "Protected route wrapper that checks authentication and admin status, displaying appropriate error messages or rendering children for authorized admins.",
  "frontend/src/components/Cart.tsx": "Empty file (cart component removed as part of cart removal feature).",
  "frontend/src/components/CartButton.tsx": "Empty file (cart button component removed as part of cart removal feature).",
  "frontend/src/components/Footer.tsx": "Footer component displaying company info, quick navigation links (with smooth scrolling), social media buttons, and copyright information. Includes an app identifier function for tracking purposes.",
  "frontend/src/components/Header.tsx": "Fixed header component with navigation menu, scroll detection for styling changes, mobile menu toggle, and conditional rendering of Orders/Admin links based on authentication and admin status.",
  "frontend/src/components/Hero.tsx": "Hero section with background image, headline text about multi-platform shopping, CTA buttons for browsing products and learning more, and an animated scroll indicator.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps the application with Header, main content outlet, and Footer in a flex column structure.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout, manages query cache clearing on logout, and displays loading states.",
  "frontend/src/components/MarkupSettings.tsx": "Admin component for viewing and updating the global price markup percentage applied to all products, with form validation and mutation handling.",
  "frontend/src/components/NoEmailBanner.tsx": "Dismissible alert banner warning users that email notifications are unavailable and suggesting they bookmark order IDs for tracking, with localStorage persistence.",
  "frontend/src/components/OrderDetailsModal.tsx": "Modal dialog displaying full order details including customer info, order items with pricing, stock verification panel, return policy, and admin controls for updating status and adding fulfillment notes.",
  "frontend/src/components/OrderTimeline.tsx": "Visual timeline component showing order status progression through stages (pending, processing, shipped, delivered) with icons and progress indicators, plus special handling for cancelled orders.",
  "frontend/src/components/Payment.tsx": "Empty file with no content.",
  "frontend/src/components/PaymentSetup.tsx": "Admin-only component that displays a form to configure Stripe payment settings (secret key and allowed countries) when Stripe is not yet configured.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product card with image, name, description, price, platform badge/logo, and a link to view the product on its original platform.",
  "frontend/src/components/Products.tsx": "Main products section that integrates ProductSearch and displays a grid of ProductCards, switching between all products and search results based on user input.",
  "frontend/src/components/ProductSearch.tsx": "Search interface with text input and platform filter dropdown that triggers product search on button click or Enter key press.",
  "frontend/src/components/ReturnPolicyDisplay.tsx": "Displays platform-specific return policy information (return period and policy URL) for Amazon, Flipkart, Meesho, and BlinkIt.",
  "frontend/src/components/StockVerificationPanel.tsx": "Admin panel for manually verifying stock availability of products in an order with radio buttons for available/check-official/unavailable status and links to official brand websites.",
  "frontend/src/contexts/CartContext.tsx": "Empty file, likely intended for shopping cart state management context.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control with admin token and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useCreateCheckoutSession.ts": "Mutation hook that calls the backend actor to create a Stripe checkout session with shopping items and redirect URLs, returning the session ID and URL.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including product management, order creation/retrieval, admin checks, order status updates, and Stripe configuration using the actor from useActor hook.",
  "frontend/src/index.css": "Defines global styles with Tailwind CSS, custom CSS variables for a warm earth-tone color palette (light/dark modes), typography using Playfair Display and Inter fonts, and a hexagonal background pattern utility.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page displaying order statistics, total revenue, and quick actions with MarkupSettings component, protected by AdminGuard.",
  "frontend/src/pages/AdminOrders.tsx": "Admin order management page showing a table of all orders with filtering, status badges, revenue metrics, and order detail modal, protected by AdminGuard.",
  "frontend/src/pages/Checkout.tsx": "Checkout page with a form for collecting customer information (name, email, phone, address) using react-hook-form, which passes data to PaymentSetup component for payment processing.",
  "frontend/src/pages/HomePage.tsx": "Main landing page composing Hero, Products, and About components with a hexagonal pattern background.",
  "frontend/src/pages/OrderTracking.tsx": "Displays user's order history with status badges, order timelines, return policy information, and requires Internet Identity authentication to view orders.",
  "frontend/src/pages/PaymentFailure.tsx": "Shows payment failure message with troubleshooting tips and navigation buttons to return to checkout or continue shopping.",
  "frontend/src/pages/PaymentSuccess.tsx": "Displays payment success confirmation, creates an order from session_id URL parameter, shows order ID, and includes NoEmailBanner component.",
  "frontend/src/router.tsx": "Configures TanStack Router with routes for home, checkout, payment success/failure, order tracking, and admin dashboard/orders pages.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette using OKLCH, extended theme with custom fonts (Inter, Playfair Display), animations, and design tokens for a warm e-commerce aesthetic.",
  "project_state.json": "Project state tracking removal of cart functionality from an e-commerce site, listing 8 completed features for removing CartContext, Cart component, CartButton, and cart-related logic from various pages."
}