{
  "backend/main.mo": "Main backend actor implementing a multi-platform e-commerce system with products, orders, user profiles, Stripe payment integration, role-based access control (admin/user permissions), and checkout session management.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Text file containing JSON summaries of all frontend components, pages, hooks, and configuration files describing their functionality and purpose.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using OKLCH color space for backgrounds, foregrounds, borders, and UI elements.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the React application.",
  "frontend/src/App.tsx": "Root React component that renders the TanStack RouterProvider with the configured router.",
  "frontend/src/components/About.tsx": "About section component displaying three feature cards (Creative Excellence, Goal-Oriented, Passionate Work) and portfolio welcome content with icons and descriptions.",
  "frontend/src/components/AdminGuard.tsx": "Protected route component that checks user authentication and admin status, displaying appropriate error messages or rendering children for authorized admins.",
  "frontend/src/components/Cart.tsx": "Shopping cart component displaying cart items with quantity controls, remove buttons, total calculation, and checkout navigation with empty state handling.",
  "frontend/src/components/CartButton.tsx": "Header button component with item count badge that opens a sheet/drawer containing the full Cart component.",
  "frontend/src/components/Footer.tsx": "Footer component displaying company info, quick navigation links (with smooth scrolling), social media buttons, and copyright information. Includes email contact and dynamic year display.",
  "frontend/src/components/Header.tsx": "Fixed header with navigation, mobile menu toggle, cart button, login button, and conditional admin/orders links. Handles smooth scrolling to page sections and background blur on scroll.",
  "frontend/src/components/Hero.tsx": "Hero section with background image, headline text, CTA buttons for browsing products and learning more, plus an animated scroll indicator arrow.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component that renders Header, page content via Outlet, and Footer in a flex column structure.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that toggles between login and logout states using Internet Identity, with loading state and query cache clearing on logout.",
  "frontend/src/components/MarkupSettings.tsx": "Admin component for viewing and updating the global price markup percentage applied to all products, with form validation and mutation handling.",
  "frontend/src/components/NoEmailBanner.tsx": "Dismissible alert banner warning users that email notifications are unavailable and suggesting they bookmark order IDs for tracking. Uses localStorage to persist dismissal.",
  "frontend/src/components/OrderDetailsModal.tsx": "Modal dialog displaying full order details including customer info, order items with pricing, stock verification panel, return policy, and admin controls for updating status and adding fulfillment notes.",
  "frontend/src/components/OrderTimeline.tsx": "Visual timeline component showing order status progression through stages (pending, processing, shipped, delivered) with icons and progress indicators, plus special handling for cancelled orders.",
  "frontend/src/components/Payment.tsx": "Payment component that displays customer shipping info and initiates Stripe checkout by creating a session with cart items and redirect URLs.",
  "frontend/src/components/PaymentSetup.tsx": "Admin-only component that displays a configuration form for setting up Stripe secret key and allowed countries when Stripe is not yet configured.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product with image, platform logo, price, description, and buttons to add to cart or view on the original platform.",
  "frontend/src/components/Products.tsx": "Main products section that displays either all products or filtered search results in a responsive grid layout with loading and empty states.",
  "frontend/src/components/ProductSearch.tsx": "Search interface with text input and platform dropdown filter that triggers product search on button click or Enter key.",
  "frontend/src/components/ReturnPolicyDisplay.tsx": "Displays platform-specific return policy information with return period and link to official policy page for Amazon, Flipkart, Meesho, and BlinkIt.",
  "frontend/src/components/StockVerificationPanel.tsx": "Admin panel for manually verifying stock availability of products in an order with radio buttons for available/check-official/unavailable status and links to brand websites.",
  "frontend/src/contexts/CartContext.tsx": "React context providing cart state management with localStorage persistence, including add/remove/update/clear operations and total/count calculations.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useCreateCheckoutSession.ts": "React Query mutation hook that creates a Stripe checkout session by calling the backend actor with shopping items and redirect URLs, returning the session ID and URL.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including product management (search, add, get all), order management (create, get, update status), admin checks, and Stripe configuration, all using the actor from useActor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom warm earth-tone color palette for light and dark modes, using Playfair Display for headings and Inter for body text with custom CSS variables for theming.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context wrapping the main App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page displaying overview statistics (total orders, revenue) and quick actions, protected by AdminGuard, with a MarkupSettings component for configuration.",
  "frontend/src/pages/AdminOrders.tsx": "Admin order management page showing a table of all orders with details, status badges, and actions to view individual orders via OrderDetailsModal, protected by AdminGuard and displaying a NoEmailBanner.",
  "frontend/src/pages/Checkout.tsx": "Checkout page component that collects customer information via a form, displays cart summary, and integrates with Payment and PaymentSetup components to process orders.",
  "frontend/src/pages/HomePage.tsx": "Main landing page component that renders Hero, Products, and About sections in sequence.",
  "frontend/src/pages/OrderTracking.tsx": "Order tracking page that displays user's order history with status badges, timelines, and return policy information; requires Internet Identity authentication.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure page that displays error message and provides options to retry checkout or continue shopping.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success page that creates an order from cart items after successful payment, displays order ID, and clears the cart.",
  "frontend/src/router.tsx": "TanStack Router configuration defining all application routes including home, checkout, payment success/failure, order tracking, and admin pages.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both regular query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette using OKLCH, extended theme settings for typography, shadows, animations, and design tokens for a warm, earthy aesthetic.",
  "project_state.json": "Project state tracking for a multi-platform dropshipping e-commerce aggregator that collects products from Amazon, Flipkart, Meesho, and BlinkIt. Includes 21 completed features covering homepage, product catalog, shopping cart, checkout, payment processing (Stripe), order management, and admin dashboard, with known limitations on email notifications and automatic stock checking due to platform constraints."
}